Revit 2024 API
RevisionsOnSheetUIServiceData.ParamId Property
 the parameter id
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ElementId ParamId { get; }
Visual Basic
Public ReadOnly Property ParamId As ElementId
	Get
Visual C++
public:
property ElementId^ ParamId {
	ElementId^ get ();
}
See Also
RevisionsOnSheetUIServiceData Class
Autodesk.Revit.UI Namespace